---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMultishapeTransitionRectovalParam
source: html/1020d2a8-b916-5225-a759-f3efccf27ea2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurvetypeMultishapeTransitionRectovalParam Property

"Multi Shape Transition Rect to Oval"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurvetypeMultishapeTransitionRectovalParam { get; }
```